projects/openfoam/programming/overset/faucetAndSink/backgroundMesh/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    oversetZone
    {
        solidBodyMotionFunction linearMotion;
        linearMotionCoeffs
        {
            velocity      (0.06 0.0 0.0);
        }
//        solidBodyMotionFunction oscillatingLinearMotion;
//        oscillatingLinearMotionCoeffs
//        {
//            amplitude       (0.03 0 0);
//            omega           30;
//        }
    }
}

// ************************************************************************* //
