projects/openfoam/programming/overset/faucetAndSink/backgroundMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (-0.5 -0.5  0.0) //0
    ( 0.5 -0.5  0.0) //1
    ( 0.5  0    0.0) //2
    (-0.5  0    0.0) //3
    (-0.5 -0.5  0.1) //4
    ( 0.5 -0.5  0.1) //5
    ( 0.5  0    0.1) //6
    (-0.5  0    0.1) //7
	(-0.5  0.25 0.0) //8
	( 0.5  0.25 0.0) //9
	(-0.5  0.25 0.1) //10
	( 0.5  0.25 0.1) //11
	(-0.5  0.5  0.0) //12
	( 0.5  0.5  0.0) //13
	(-0.5  0.5  0.1) //14
	( 0.5  0.5  0.1) //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7)       (70 34 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10)     (70 13 1) simpleGrading (1 1 1)
    hex (8 9 13 12 10 11 15 14) (70 23 1) simpleGrading (1 1 1));

edges
(
);

boundary
(
    sink
    {
        type wall;
        faces
        (
            (3 7 10 8)
			(0 4 7 3)
			(0 1 5 4)
			(1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 10 14 12)
            (12 14 15 13)
            (9 13 15 11)
            (2 9 11 6)
        );
    }
);

// ************************************************************************* //
